---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry.UnregisterPointCloudEngine(System.String)
source: html/ce007ea8-0f06-d575-05db-042517690264.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry.UnregisterPointCloudEngine Method

Unregisters the point cloud engine associated to a particular identifier.

## Syntax (C#)
```csharp
public static void UnregisterPointCloudEngine(
	string identifier
)
```

## Parameters
- **identifier** (`System.String`) - The identifier of the engine to be unregistered.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null